[
  {
    productId: '1d17991f-c494-459f-b52d-12782fd174ed',
    sku: 'B07FRDZ5NF',
    name: 'NuWallpaper Taupe Mirei Wallpaper',
    subCategoryId: '12-wallpapers',
    shortDescription: 'Inspired by Japanese blossoms, this floral pattern has a timeless elegance. The blue, yellow, and white flowers sprawl over a grey linen print background.',
    description: 'Modern floral pattern with Eastern influence. Peel and stick to apply, pull up to remove. NuWallpaper is safe for walls and leaves no sticky residue behind. Easily repositionable while installing NuWallpaper sticks to any smooth, flat surface—perfect for DIY projects. Ideal for rental or home decorating Comes on a 20.5-in x 18-ft roll and covers about 30.75 sq.ft.',
    brand: 'NuWallpaper',
    amount: {
      value: 126,
      unit: "roll(s)"
    },
    availability: "In Stock",
    price: {
      value: '49.99',
      currency: 'USD',
    },
    label: 'New',
    averageRating: 4.7,
    reviews: [
      {
        title: 'Beautiful wallpaper!',
        text: "The quality of this paper is amazing and it's much more beautiful in person than online.It a nice tone of gray, blue and gold! I used this paper for an accent wall in a room.A lot of people mentioned that its difficult to match the patterns up once you cut it and it caused a lot of wasted paper.",
        author: 'Michael Aguirre',
        date: 'Sun Nov 08 2020 22:34:22 GMT+0200 (Eastern European Standard Time)',
        rating: 4.6,
      },
      {
        title: 'I LOVE THIS WALLPAPER',
        text: "I absolutely LOVE this wallpaper! I’ve never tried a peel and stick before, but now that I have this is SO easy and mess free! I have gotten SO many compliments on it! I didn’t have much waste when lining up the pattern. I guess it would be based on the height of the wall, but for me it was fine. If you are on the fence with this one, this is a MUST buy!!",
        author: 'Tessa Patterson',
        date: 'Wed May 20 2020 16:12:43 GMT+0300 (Eastern European Summer Time)',
        rating: 4.8,
      },
      {
        title: 'Wish I had discovered this sooner',
        text: "I have been renting a tiny bungalow for several years now. How did I not know about this amazing product? I applied the wallpaper to just one wall and with the help of a rubber edged scraper and an exacto-knife, it is perfect! I love the look.",
        author: 'Patricia Brown',
        date: 'Tue Jul 07 2020 23:41:05 GMT+0300 (Eastern European Summer Time)',
        rating: 4.7,
      }
    ],
    tags: ['peel', 'stick', 'wallpaper', 'taupe', 'flowers'],
    images: ['https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B07FRDZ5NF.jpg'],
    mainImage: 'https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B07FRDZ5NF.jpg',
  },
  {
    productId: '7760f4f7-f625-459d-b16c-90d40e0c169f',
    sku: 'B01L9TE420',
    name: 'York Wallcoverings Graphic Damask Removable Wallpaper',
    subCategoryId: '12-wallpapers',
    shortDescription: 'Floral medallions appear in a diamond configuration on a solid background. This statement making wall covering, influenced by traditional damask design, has the bombastic look of bold modern décor.',
    description: "Packaged and sold in double rolls.Prepasted - washable - strippable. Double roll dimension 27 inches x 27 feet = 60.75 square feet; Design repeat: 25.25 inches; Design match: Drop. Sure strip completely removable guaranteed. Moisture resistant. Easy to apply - just dip in water. Made in the USA",
    brand: 'York Wallcoverings',
    amount: {
      value: 98,
      unit: "roll(s)"
    },
    availability: "In Stock",
    price: {
      value: '72.99',
      currency: 'USD',
    },
    label: 'Sale',
    averageRating: 4.0,
    reviews: [
      {
        title: 'Buy extra! Not for beginners.',
        text: "It is beautiful. I haven't worked with vinyl wallpaper before. There is a learning curve! I ended up buying 2 extra rolls due to my own mistakes!",
        author: 'Lewis Wallace',
        date: 'Tue Jul 21 2020 17:03:47 GMT+0300 (Eastern European Summer Time)',
        rating: 3.8,
      },
      {
        title: 'I loved this',
        text: "Really nice addition and it makes your house like a model home in like an hour.",
        author: 'Rachelle Crowe',
        date: 'Mon May 18 2020 14:27:10 GMT+0300 (Eastern European Summer Time)',
        rating: 4.0,
      },
      {
        title: 'A Few Challenges, but overall great',
        text: "This was my third experience putting up wallpaper, but the first with pre-adhesive wallpaper. I was a bit concerned about doing this and the “folding” method, but that was the easiest part. I purchased a bug spray from a local store filled it with water and laid the wallpaper on my tiled floor sprayed and hung. The paper feels like a vinyl paperstock.",
        author: 'William Wheeler',
        date: 'Fri Jul 17 2020 18:13:00 GMT+0300 (Eastern European Summer Time)',
        rating: 4.3,
      }
    ],
    tags: ['graphic', 'damask', 'removable', 'black', 'chic', 'tres'],
    images: ['https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B01L9TE420.jpg'],
    mainImage: 'https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B01L9TE420.jpg',
  },
  {
    productId: '09d995a3-fbb4-4622-a1ed-181fbbe8c877',
    sku: 'B08D2918JB',
    name: 'Tempaper Blue Moon Moire Dots Wallpaper',
    subCategoryId: '12-wallpapers',
    shortDescription: 'Your happy space—have you found it? Let these playful blue color dots lead the way. As a temporary wallpaper pattern, they please with ease. Peel, align, stick, repeat. And if you need to, pull away and start again.',
    description: "Bring a dash of blue and a touch of modern style to a bathroom, kitchen, teen bedroom or any spot in your home with this sophisticated, speckled dot peel and stick wallpaper. A ready-to-use, mess-free, self-adhesive wallpaper. No pastes or glues needed, and no residue left behind. Repositionable, making prints easy to align. Our removable wallpaper makes it very easy to get your placement exactly how you want it, even if it takes a few tries.",
    brand: 'Tempaper',
    amount: {
      value: 161,
      unit: "roll(s)"
    },
    availability: "In Stock",
    price: {
      value: '31.99',
      currency: 'USD',
    },
    label: 'Sale',
    averageRating: 4.1,
    reviews: [
      {
        title: 'Get a squugee and give up on trying to match up the pattern!',
        text: "Perfect for our master bath as an accent wall. Definitely easier to apply with a smoothing tool. I used my shower squeegee. The pattern was so hard to match up I gave up.Once the wall was done I feel matching the pattern didn't really matter. Very happy with the outcome!",
        author: 'Kaylee Smith',
        date: 'Wed Jan 13 2021 19:18:47 GMT+0200 (Eastern European Standard Time)',
        rating: 3.9,
      },
      {
        title: 'Would recommend',
        text: "I was actually really skeptical of this product after reading the reviews... but after using it, think it’s great! Easy to manage and pull off if you need to try again. It’s design helps so that things don’t have to line up perfectly. It’s much easier to do with the help of someone else... overall I would definitely recommend this product.",
        author: 'Grisel Bahena',
        date: 'Sun Feb 14 2021 03:28:50 GMT+0200 (Eastern European Standard Time)',
        rating: 4.0,
      },
      {
        title: 'So easy to apply',
        text: "I was able to apply the wallpaper by myself. The adhesion is great, but is such that you can remove it if your lines are not correct. The pop of color is great.",
        author: 'Anne Gallagher',
        date: 'Fri Feb 12 2021 18:38:40 GMT+0200 (Eastern European Standard Time)',
        rating: 4.2,
      }
    ],
    tags: ['blue', 'moon', 'removable', 'tempaper', 'dots'],
    images: ['https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B08D2918JB.jpg'],
    mainImage: 'https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B08D2918JB.jpg',
  },
  {
    productId: 'c42e5e7d-d6d2-46bf-99b7-65bc5751c9dc',
    sku: 'B00OBXM6XG',
    name: 'NuWallpaper Hadrian Stone Wall Peel and Stick Wallpaper',
    subCategoryId: '12-wallpapers',
    shortDescription: 'This peel and stick wallpaper gives the look of a stone wall. The chic design is perfect for a living room feature wall or kitchen backsplash. Comes on a 20.5 in by 18 ft roll.',
    description: "Peel and stick to apply, pull up to remove. Wallpaper is safe for walls and leaves no sticky residue behind. Fix mistakes easily by repositioning. Wallpaper sticks to any smooth, flat surface - perfect for DIY projects. Ideal for rental or home decorating. Comes on a 20.5-in x 18-ft roll and covers about 30.75 sq. ft.. Gives the look of a stone wall. Design repeat of 21-in.",
    brand: 'NuWallpaper',
    amount: {
      value: 211,
      unit: "roll(s)"
    },
    availability: "In Stock",
    price: {
      value: '28.99',
      currency: 'USD',
    },
    label: 'New',
    averageRating: 4.5,
    reviews: [
      {
        title: 'Awesome Product!',
        text: "Because I have a lot of experience with hanging and removing traditional wallpaper, I must say that this product is amazing!! Hanging was easy and although I was forwarned about paper cuts, I did get a couple small cuts due to carelessness no big deal. Being able to reposition at will makes installation a breeze.",
        author: 'Patrick Morgan',
        date: 'Tue Nov 24 2020 20:01:59 GMT+0200 (Eastern European Standard Time)',
        rating: 4.3,
      },
      {
        title: 'Looks GORGEOUS',
        text: "Used this to spruce up our kitchen! Used less than two rolls to do this. It completely changes the look of my kitchen. Very easy to use. Love it",
        author: 'Susan Becker',
        date: 'Wed Jan 20 2021 06:20:09 GMT+0200 (Eastern European Standard Time)',
        rating: 4.7,
      },
      {
        title: 'Looks really great',
        text: "This paper works so well, if I made a mistake... I just peeled and redid that area without any damage.. It could've been the surface I was putting it on, but it's been up in my kitchen for a month and hasn't changed lol. Everyone says it looks real in pictures... Obvi if you look hard enough, you can tell it's paper. But it feels great to have the appearance of stone.",
        author: 'Kayla M. Blackwell',
        date: 'Thu Apr 09 2020 07:22:19 GMT+0300 (Eastern European Summer Time)',
        rating: 4.5,
      }
    ],
    tags: ['hadrian', 'stone', 'peel', 'stick'],
    images: ['https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B00OBXM6XG.jpg'],
    mainImage: 'https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B00OBXM6XG.jpg',
  },
  {
    productId: '72449710-4254-4e84-a4a0-9595c140fe8e',
    sku: 'B07VRS5PWP',
    name: 'InHome Neutral Sisal Breeze Wallpaper',
    subCategoryId: '12-wallpapers',
    shortDescription: 'With a detailed woven design, this peel and stick wallpaper is made to resemble grass cloth. Light teal, beige and cream hues emphasize its airy energy. Sisal Breeze Peel & Stick Wallpaper contains one roll that measures 198 x 20. 5 inches.',
    description: "Breezy faux grass cloth design with an airy palette. Peel and stick to apply, pull up to remove. Peel and stick wallpaper is safe for walls and leaves no sticky residue behind. Easily repositionable while installing. Peel and stick wallpaper sticks to any smooth, flat surface - perfect for DIY projects. Comes on a 20. 5-in x 16. 5-ft roll and covers about 28. 2 sq. ft.",
    brand: 'InHome',
    amount: {
      value: 134,
      unit: "roll(s)"
    },
    availability: "In Stock",
    price: {
      value: '25.99',
      currency: 'USD',
    },
    label: 'Sale',
    averageRating: 3.5,
    reviews: [
      {
        title: 'Wonderful Product!',
        text: "This wallpaper is very attractive and truly easy to apply. I have not had the occasion of removing it yet to opine on how easily it will come off, but so far, so great.",
        author: 'Bacon Jonnie',
        date: 'Mon May 11 2020 18: 16: 17 GMT + 0300(Eastern European Summer Time)',
        rating: 4.0,
      },
      {
        title: 'Not bad',
        text: "I am in the process of updating a vintage motorhome and decided to wallpaper it with this product. It was easy to use and looks not bad.",
        author: 'Nancy Carrasco Pineda',
        date: 'Wed Dec 16 2020 03:44:12 GMT+0200 (Eastern European Standard Time)',
        rating: 3.0,
      },
      {
        title: 'Watch out for color differences in the product',
        text: "I really love this product; however, there were noticeable color differences with my last roll. Despite that, I highly recommend using this as an easy way to update your living space.",
        author: 'Henry D Anderson',
        date: 'Sat Aug 15 2020 08:25:41 GMT+0300 (Eastern European Summer Time)',
        rating: 3.5,
      }
    ],
    tags: ['neutral', 'sisal', 'breeze', 'inhome'],
    images: ['https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B07VRS5PWP.jpg'],
    mainImage: 'https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B07VRS5PWP.jpg',
  },
  {
    productId: '71e123b0-f588-4421-9850-109fb8f8fd72',
    sku: 'B0026SUA1S',
    name: 'Graham & Brown Superfresco Easy Crocodile Black Wallpaper',
    subCategoryId: '12-wallpapers',
    shortDescription: 'A classic yet incredibly elegant wallpaper. A dramatic black colorway will bring a lavish finish to a glamorous room. Available in eight color ways.',
    description: "Paste the wall; 25 inch pattern repeat. Straight match. All of the wallpaper has been sourced in a sustainable manner. Roll Length: 32.80 feet; Width: 20.47 inches; Pattern Repeat: 25.19 inches; Design Match: Straight; Drop Size: 12.59 inches; Weight: 2.82 pounds.",
    brand: 'Graham & Brown',
    amount: {
      value: 201,
      unit: "roll(s)"
    },
    availability: "In Stock",
    price: {
      value: '69.99',
      currency: 'USD',
    },
    label: 'New',
    averageRating: 4.5,
    reviews: [
      {
        title: 'Amazing',
        text: "Make sure to order more than you need so that all of your order is from the same batch. I read on previous posts that the color was different if it came from a different batch. The instructions also tell you to check that from beginning. In my photo I posted there is NO difference in color, it's just the light from the window. The wall paper went up easy and it's crazy soft. I love it!",
        author: 'Sara Malcoln',
        date: 'Sat Dec 19 2020 19:26:07 GMT+0200 (Eastern European Standard Time)',
        rating: 4.0,
      },
      {
        title: 'Fabulous wallpaper',
        text: "Been looking at this for a while and out of stock everywhere - didn't think to check here. Came very quickly. The paper is fabulous. My partner put it up on one bedroom wall. It looks great. There is a pattern but I read another review that said they hadn't bothered to match - so neither did we. You can get away with it as the pattern is so random. I actually struggled to find it.",
        author: 'John Paulino',
        date: 'Mon Nov 16 2020 18:51:17 GMT+0200 (Eastern European Standard Time)',
        rating: 4.5,
      },
      {
        title: "Don't hesitate",
        text: "At first my boyfriend was adamant to put this on the wall of our powder room. But once it was up, it transformed our powder room into plain boring to elegant and sophisticated. Priced well too.",
        author: 'Henry Camerony',
        date: 'Mon Oct 12 2020 22: 27: 16 GMT + 0300(Eastern European Summer Time)',
        rating: 5.0,
      }
    ],
    tags: ['superfresco', 'easy', 'crocodile', 'black'],
    images: ['https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B0026SUA1S.jpg'],
    mainImage: 'https://my-s3bucket-test-001.s3.amazonaws.com/wallpapers/B0026SUA1S.jpg',
  },
]
